Output from `terraform plan`
```
            "Jira"           = "main"
            "Resource_Type"  = "dms"
            "Service_Bundle" = "true"
            "name"           = "dpr-dms-nomis-oracle-s3-safety-task-preproduction"
        }
        # (11 unchanged attributes hidden)
    }

  # module.dms-task["sentence"].module.dms_task.data.template_file.table-mappings will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "table-mappings" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + rules = [
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENT_CALCULATIONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450001"
                      + rule-name      = "nomis.offender_sent_calculations"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENTENCE_TERMS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450002"
                      + rule-name      = "nomis.offender_sentence_terms"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENTENCES"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450003"
                      + rule-name      = "nomis.offender_sentences"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_REORDER_SENTENCES"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450004"
                      + rule-name      = "nomis.offender_reorder_sentences"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENT_CONDITIONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450005"
                      + rule-name      = "nomis.offender_sent_conditions"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENTENCE_ADJUSTS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450006"
                      + rule-name      = "nomis.offender_sentence_adjusts"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENTENCE_CHARGES"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450007"
                      + rule-name      = "nomis.offender_sentence_charges"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_SENTENCE_STATUSES"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450008"
                      + rule-name      = "nomis.offender_sentence_statuses"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "SENTENCE_ADJUSTMENTS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450009"
                      + rule-name      = "nomis.sentence_adjustments"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "SENTENCE_CALC_TYPES"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450010"
                      + rule-name      = "nomis.sentence_calc_types"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "SENTENCE_TERM_ADJUSTMENTS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450011"
                      + rule-name      = "nomis.sentence_term_adjustments"
                      + rule-type      = "selection"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "convert-lowercase"
                      + rule-id        = "999999999"
                      + rule-name      = "999999999"
                      + rule-target    = "table"
                      + rule-type      = "transformation"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "${input_schema}"
                        }
                      + rule-action    = "rename"
                      + rule-id        = "999999998"
                      + rule-name      = "999999998"
                      + rule-target    = "schema"
                      + rule-type      = "transformation"
                      + value          = "${output_space}"
                    },
                  + {
                      + data-type      = {
                          + length = 50
                          + type   = "string"
                        }
                      + expression     = "$AR_H_CHANGE_SEQ"
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "add-column"
                      + rule-id        = "999999997"
                      + rule-name      = "999999997"
                      + rule-target    = "column"
                      + rule-type      = "transformation"
                      + value          = "checkpoint_col"
                    },
                ]
            }
        )
      + vars     = {
          + "input_schema" = "OMS_OWNER"
          + "output_space" = "nomis"
        }
    }

  # module.dms-task["sentence"].module.dms_task.aws_dms_replication_task.dms-replication[0] will be updated in-place
  ~ resource "aws_dms_replication_task" "dms-replication" {
        id                        = "dpr-dms-nomis-oracle-s3-sentence-task-preproduction"
      ~ table_mappings            = jsonencode(
            {
              - rules = [
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENT_CALCULATIONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450001"
                      - rule-name      = "nomis.offender_sent_calculations"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENTENCE_TERMS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450002"
                      - rule-name      = "nomis.offender_sentence_terms"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENTENCES"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450003"
                      - rule-name      = "nomis.offender_sentences"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_REORDER_SENTENCES"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450004"
                      - rule-name      = "nomis.offender_reorder_sentences"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENT_CONDITIONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450005"
                      - rule-name      = "nomis.offender_sent_conditions"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENTENCE_ADJUSTS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450006"
                      - rule-name      = "nomis.offender_sentence_adjusts"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENTENCE_CHARGES"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450007"
                      - rule-name      = "nomis.offender_sentence_charges"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_SENTENCE_STATUSES"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450008"
                      - rule-name      = "nomis.offender_sentence_statuses"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "SENTENCE_ADJUSTMENTS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450009"
                      - rule-name      = "nomis.sentence_adjustments"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "SENTENCE_CALC_TYPES"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450010"
                      - rule-name      = "nomis.sentence_calc_types"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "SENTENCE_TERM_ADJUSTMENTS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450011"
                      - rule-name      = "nomis.sentence_term_adjustments"
                      - rule-type      = "selection"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "convert-lowercase"
                      - rule-id        = "999999999"
                      - rule-name      = "999999999"
                      - rule-target    = "table"
                      - rule-type      = "transformation"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                        }
                      - rule-action    = "rename"
                      - rule-id        = "999999998"
                      - rule-name      = "999999998"
                      - rule-target    = "schema"
                      - rule-type      = "transformation"
                      - value          = "nomis"
                    },
                  - {
                      - data-type      = {
                          - length = 50
                          - type   = "string"
                        }
                      - expression     = "$AR_H_CHANGE_SEQ"
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "add-column"
                      - rule-id        = "999999997"
                      - rule-name      = "999999997"
                      - rule-target    = "column"
                      - rule-type      = "transformation"
                      - value          = "checkpoint_col"
                    },
                ]
            }
        ) -> (known after apply)
        tags                      = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "dms"
            "Service_Bundle" = "true"
            "name"           = "dpr-dms-nomis-oracle-s3-sentence-task-preproduction"
        }
        # (11 unchanged attributes hidden)
    }

  # module.dms-task["transactions"].module.dms_task.data.template_file.table-mappings will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "table-mappings" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + rules = [
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "MERGE_TRANSACTION_LOGS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450001"
                      + rule-name      = "nomis.merge_transaction_logs"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "MERGE_TRANSACTIONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450002"
                      + rule-name      = "nomis.merge_transactions"
                      + rule-type      = "selection"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "convert-lowercase"
                      + rule-id        = "999999999"
                      + rule-name      = "999999999"
                      + rule-target    = "table"
                      + rule-type      = "transformation"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "${input_schema}"
                        }
                      + rule-action    = "rename"
                      + rule-id        = "999999998"
                      + rule-name      = "999999998"
                      + rule-target    = "schema"
                      + rule-type      = "transformation"
                      + value          = "${output_space}"
                    },
                  + {
                      + data-type      = {
                          + length = 50
                          + type   = "string"
                        }
                      + expression     = "$AR_H_CHANGE_SEQ"
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "add-column"
                      + rule-id        = "999999997"
                      + rule-name      = "999999997"
                      + rule-target    = "column"
                      + rule-type      = "transformation"
                      + value          = "checkpoint_col"
                    },
                ]
            }
        )
      + vars     = {
          + "input_schema" = "OMS_OWNER"
          + "output_space" = "nomis"
        }
    }

  # module.dms-task["transactions"].module.dms_task.aws_dms_replication_task.dms-replication[0] will be updated in-place
  ~ resource "aws_dms_replication_task" "dms-replication" {
        id                        = "dpr-dms-nomis-oracle-s3-transactions-task-preproduction"
      ~ table_mappings            = jsonencode(
            {
              - rules = [
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "MERGE_TRANSACTION_LOGS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450001"
                      - rule-name      = "nomis.merge_transaction_logs"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "MERGE_TRANSACTIONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450002"
                      - rule-name      = "nomis.merge_transactions"
                      - rule-type      = "selection"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "convert-lowercase"
                      - rule-id        = "999999999"
                      - rule-name      = "999999999"
                      - rule-target    = "table"
                      - rule-type      = "transformation"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                        }
                      - rule-action    = "rename"
                      - rule-id        = "999999998"
                      - rule-name      = "999999998"
                      - rule-target    = "schema"
                      - rule-type      = "transformation"
                      - value          = "nomis"
                    },
                  - {
                      - data-type      = {
                          - length = 50
                          - type   = "string"
                        }
                      - expression     = "$AR_H_CHANGE_SEQ"
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "add-column"
                      - rule-id        = "999999997"
                      - rule-name      = "999999997"
                      - rule-target    = "column"
                      - rule-type      = "transformation"
                      - value          = "checkpoint_col"
                    },
                ]
            }
        ) -> (known after apply)
        tags                      = {
            "Domain"         = "transactions"
            "Jira"           = "main"
            "Resource_Type"  = "dms"
            "Service_Bundle" = "true"
            "name"           = "dpr-dms-nomis-oracle-s3-transactions-task-preproduction"
        }
        # (11 unchanged attributes hidden)
    }

  # module.dms-task["visits"].module.dms_task.data.template_file.table-mappings will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "table-mappings" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + rules = [
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_VISITS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450001"
                      + rule-name      = "nomis.offender_visits"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_CONTACT_PERSONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450003"
                      + rule-name      = "nomis.offender_contact_persons"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_PERSON_RESTRICTS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450004"
                      + rule-name      = "nomis.offender_person_restricts"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_RESTRICTIONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450005"
                      + rule-name      = "nomis.offender_restrictions"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_VISIT_ORDERS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450006"
                      + rule-name      = "nomis.offender_visit_orders"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_VISIT_VISITORS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450007"
                      + rule-name      = "nomis.offender_visit_visitors"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "OFFENDER_VO_VISITORS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450008"
                      + rule-name      = "nomis.offender_vo_visitors"
                      + rule-type      = "selection"
                    },
                  + {
                      + filters        = []
                      + object-locator = {
                          + schema-name = "OMS_OWNER"
                          + table-name  = "VISITOR_RESTRICTIONS"
                        }
                      + rule-action    = "include"
                      + rule-id        = "516450009"
                      + rule-name      = "nomis.visitor_restrictions"
                      + rule-type      = "selection"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "convert-lowercase"
                      + rule-id        = "999999999"
                      + rule-name      = "999999999"
                      + rule-target    = "table"
                      + rule-type      = "transformation"
                    },
                  + {
                      + object-locator = {
                          + schema-name = "${input_schema}"
                        }
                      + rule-action    = "rename"
                      + rule-id        = "999999998"
                      + rule-name      = "999999998"
                      + rule-target    = "schema"
                      + rule-type      = "transformation"
                      + value          = "${output_space}"
                    },
                  + {
                      + data-type      = {
                          + length = 50
                          + type   = "string"
                        }
                      + expression     = "$AR_H_CHANGE_SEQ"
                      + object-locator = {
                          + schema-name = "%"
                          + table-name  = "%"
                        }
                      + rule-action    = "add-column"
                      + rule-id        = "999999997"
                      + rule-name      = "999999997"
                      + rule-target    = "column"
                      + rule-type      = "transformation"
                      + value          = "checkpoint_col"
                    },
                ]
            }
        )
      + vars     = {
          + "input_schema" = "OMS_OWNER"
          + "output_space" = "nomis"
        }
    }

  # module.dms-task["visits"].module.dms_task.aws_dms_replication_task.dms-replication[0] will be updated in-place
  ~ resource "aws_dms_replication_task" "dms-replication" {
        id                        = "dpr-dms-nomis-oracle-s3-visits-task-preproduction"
      ~ table_mappings            = jsonencode(
            {
              - rules = [
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_VISITS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450001"
                      - rule-name      = "nomis.offender_visits"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_CONTACT_PERSONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450003"
                      - rule-name      = "nomis.offender_contact_persons"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_PERSON_RESTRICTS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450004"
                      - rule-name      = "nomis.offender_person_restricts"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_RESTRICTIONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450005"
                      - rule-name      = "nomis.offender_restrictions"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_VISIT_ORDERS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450006"
                      - rule-name      = "nomis.offender_visit_orders"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_VISIT_VISITORS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450007"
                      - rule-name      = "nomis.offender_visit_visitors"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "OFFENDER_VO_VISITORS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450008"
                      - rule-name      = "nomis.offender_vo_visitors"
                      - rule-type      = "selection"
                    },
                  - {
                      - filters        = []
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                          - table-name  = "VISITOR_RESTRICTIONS"
                        }
                      - rule-action    = "include"
                      - rule-id        = "516450009"
                      - rule-name      = "nomis.visitor_restrictions"
                      - rule-type      = "selection"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "convert-lowercase"
                      - rule-id        = "999999999"
                      - rule-name      = "999999999"
                      - rule-target    = "table"
                      - rule-type      = "transformation"
                    },
                  - {
                      - object-locator = {
                          - schema-name = "OMS_OWNER"
                        }
                      - rule-action    = "rename"
                      - rule-id        = "999999998"
                      - rule-name      = "999999998"
                      - rule-target    = "schema"
                      - rule-type      = "transformation"
                      - value          = "nomis"
                    },
                  - {
                      - data-type      = {
                          - length = 50
                          - type   = "string"
                        }
                      - expression     = "$AR_H_CHANGE_SEQ"
                      - object-locator = {
                          - schema-name = "%"
                          - table-name  = "%"
                        }
                      - rule-action    = "add-column"
                      - rule-id        = "999999997"
                      - rule-name      = "999999997"
                      - rule-target    = "column"
                      - rule-type      = "transformation"
                      - value          = "checkpoint_col"
                    },
                ]
            }
        ) -> (known after apply)
        tags                      = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "dms"
            "Service_Bundle" = "true"
            "name"           = "dpr-dms-nomis-oracle-s3-visits-task-preproduction"
        }
        # (11 unchanged attributes hidden)
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.get_secrets will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "get_secrets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = []
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeInstances",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_policy.lambda_execution[0] will be updated in-place
  ~ resource "aws_iam_policy" "lambda_execution" {
        id               = "arn:aws:iam::972272129531:policy/dpr-pipeline-notification-policy"
        name             = "dpr-pipeline-notification-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:*:*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInstances",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:AttachNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "dpr-pipeline-notification-role"
        name                  = "dpr-pipeline-notification-role"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id                              = "dpr-dms-dps-case-notes-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (16 unchanged attributes hidden)

      ~ postgres_settings {
          ~ heartbeat_enable             = true -> false
            # (15 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 49 to change, 0 to destroy.

```